app/controllers/songs_controller.rb

SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
SELECT "songs".* FROM "songs"
SELECT COUNT(*) FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    if params[:artist_id] # checks for present value
      @songs = Song.where(artist_id: params[:artist_id])  # finds all songs by artist
      if !@songs.empty? # returns song if present

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    if params[:artist_id]
      if @song = Song.find_by_artist_id(params[:artist_id])
        @song
      else
        flash[:alert] = "No song found"
        redirect_to artist_songs_path(params[:artist_id])
      end
    else
      @song = Song.find_by_id(params[:id])